#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdarg.h>
#include <unistd.h>
#include <fcntl.h>
#include <SDL2/SDL.h>
#include <GL/gl.h>
#include "defs.h"
#include "tick.h"
#include "things.h"

#define VRAM_TEXTURE_START	0x0A000
#define VRAM_TEXTURE_END	0x1C000

#define LIGHTMAP_SIZE	256

#define MAX_SPRITES	255
#define MAX_SPRITE_FRAMES	512

#define MAX_WEAPON_FRAMES	128

#define MAX_DRAW_SPRITES	32
#define MAX_DRAW_MASKED	16
#define MAX_DRAW_PORTALS	64

#define MAX_EXTRA_STORAGE	255

#define TEXFLAG_PEG_Y	1
#define TEXFLAG_MIRROR_X	2
#define TEXFLAG_MIRROR_Y_SWAP_XY	4

#define SECTOR_LIGHT(x)	(((x)->flags >> 4) & 7)

//#define SHOW_OCTANT

#define WIDTH	1024
#define HEIGHT	768

#define _BV(x)	(1 << (x))

// angle range: 0 to 4095
#define ANGLE_TO_DEG(x)	((float)(x) * (360.0f / 4096.0f))
#define ANGLE_TO_RAD(x)	((float)(x) * ((M_PI*2) / 4096.0f))
// angle range: 0 to 255
#define ANG8_TO_DEG(x)	((float)(x) * (360.0f / 256.0f))
#define ANG8_TO_RAD(x)	((float)(x) * ((M_PI*2) / 256.0f))

#define H_FOV	0x0200 // 90; don't change

enum
{
	MKEY_FORWARD,
	MKEY_BACKWARD,
	MKEY_STRAFE_LEFT,
	MKEY_STRAFE_RIGHT,
	//
	MKEY_ROTATE_LEFT,
	MKEY_ROTATE_RIGHT,
	//
	MKEY_GO_UP,
	MKEY_GO_DOWN,
	//
	MKEY_USE,
	//
	NUM_KEYS
};

typedef union
{
	uint8_t raw[256];
	struct
	{
		uint8_t idiv_h[256];	// @ 0x1100
		uint8_t ydepth_h[256];	// @ 0x1200
		uint8_t x2a_l[256];	// @ 0x1300
		uint8_t x2a_h[256];	// @ 0x1400
		uint8_t swap[256];	// @ 0x1500
		uint8_t bank[256];	// @ 0x1600
		uint8_t pvxjmp_l[128];	// @ 0x1700
		uint8_t pvxjmp_h[128];	// @ 0x1780
		uint8_t phxjmp_l[84];	// @ 0x1800
		uint8_t plxjmp_l[88];	// @ 0x1854
		uint8_t phxjmp_h[84];	// @ 0x18AC
		uint8_t plxjmp_h[88];	// @ 0x1900
		uint8_t xoffs_h[168];	// @ 0x1958
		uint8_t psxjmp_l[256];	// @ 0x1A00
		uint8_t psxjmp_h[256];	// @ 0x1B00
		uint8_t ptxjmp_l[128];	// @ 0x1C00
		uint8_t ptxjmp_h[128];	// @ 0x1C80
		uint8_t yoffs_l[128];	// @ 0x1D00
		uint8_t yoffs_h[128];	// @ 0x1D80
		uint8_t htan_l[128];	// @ 0x1E00
		uint8_t htan_h[128];	// @ 0x1E80
		uint8_t sign[256];	// @ 0x1F00
		uint8_t sin_l[320];	// @ 0x2000
		uint8_t sin_h[320];	// @ 0x2140
		uint8_t pxloop[0x1553];	// @ 0x2280
		// 0x37D3
	};
} tables_1100_t;

typedef union
{
	uint8_t raw[256];
	struct
	{
		uint8_t idiv_l[8192];	// @ 0xA000 (bank 59)
		uint8_t tscale_l[4096];	// @ 0xA000 (bank 60) [texture scale]
		uint8_t tscale_h[4096];	// @ 0xB000 (bank 60) [texture scale]
		uint8_t tan_l[2048];	// @ 0xA000 (bank 61)
		uint8_t tan_h[2048];	// @ 0xA800 (bank 61)
		uint8_t ydepth_l[4096];	// @ 0xB000 (bank 61)
		uint8_t atan_l[4096];	// @ 0xA000 (bank 62)
		uint8_t atan_h[4096];	// @ 0xB000 (bank 62)
		uint8_t a2x_l[2048];	// @ 0xA000 (bank 63)
		uint8_t a2x_h[2048];	// @ 0xA800 (bank 63)
		uint8_t random[2048];	// @ 0xB000 (bank 63) [rng stuff]
		uint8_t rng_mask[256];	// @ 0xB800 (bank 63) [rng stuff]
		uint8_t planex_l[256];	// @ 0xB900 (bank 63) [plane texture stuff]
		uint8_t planex_h[256];	// @ 0xBA00 (bank 63) [plane texture stuff]
		uint8_t pitch2yc[256];	// @ 0xBB00 (bank 63)
		uint8_t vidoffs_x[128];	// @ 0xBC00 (bank 63)
		uint8_t vidoffs_y[128];	// @ 0xBC80 (bank 63)
		uint8_t printint[256];	// @ 0xBD00 (bank 63)
		// 0xBEC0 contains portals
	};
} tables_A000_t;

typedef struct
{
	uint8_t sector;
	uint8_t x0, x1;
	uint8_t first_sprite;
	uint8_t masked;
} portal_t;

typedef struct
{
	uint8_t clip_top[80];
	uint8_t clip_bot[80];
	uint8_t *data;
	uint16_t *cols;
	uint8_t x0, x1;
	uint8_t y0, y1;
	uint8_t light;
	uint8_t next;
	int16_t bot;
	int16_t depth, tex_scale;
	int16_t tex_now, tex_step;
	int16_t dist, scale;
} proj_spr_t;

typedef struct
{
	int16_t tmap_scale[80];
	uint8_t clip_top[80];
	uint8_t tmap_coord[160];
	uint8_t clip_bot[80];
	int32_t scale_now, scale_step;
	int16_t bz;
	uint8_t texture;
	uint8_t x0, x1;
	uint8_t xor, ox;
	uint8_t sflags;
} proj_msk_t;

typedef struct
{
	uint32_t nhash;
	uint32_t vhash;
	uint8_t type;
	uint8_t effect[4];
	union
	{
		struct
		{
			uint8_t vera_tile_base;
			uint8_t vera_map_base;
			uint32_t colormap[MAX_LIGHTS];
		} plane;
		struct
		{
			uint8_t math_and;
			uint32_t offs_cols;
