#include "inc.h"
#include "defs.h"
#include "engine.h"
#include "editor.h"
#include "things.h"
#include "list.h"
#include "system.h"
#include "matrix.h"
#include "shader.h"
#include "render.h"
#include "tick.h"
#include "x16g.h"
#include "x16e.h"
#include "x16t.h"
#include "x16r.h"

#define USE_SPECDIV_CLIPPING

#define H_FOV	0x0200

#define PLX_CODE_BASE	(offsetof(tables_1100_t, pxloop) + 0x1100 + 0x0000)
#define PHX_CODE_BASE	(offsetof(tables_1100_t, pxloop) + 0x1100 + 0x0220)
#define PVX_CODE_BASE	(offsetof(tables_1100_t, pxloop) + 0x1100 + 0x0640)
#define PSX_CODE_BASE	(offsetof(tables_1100_t, pxloop) + 0x1100 + 0x0A01)
#define PTX_CODE_BASE	(offsetof(tables_1100_t, pxloop) + 0x1100 + 0x0FD2)
#define COLORMAP_ZP	0x22
#define LIGHTMAP_ZP	0x24
#define VIDEO_PAGE_L	0x50
#define VIDEO_PAGE_H	0x51

#define MAX_PORTALS	64

#define MAX_SPRITES	32
#define MAX_MASKED	16

typedef union
{
	uint8_t raw[256];
	struct
	{
		uint8_t idiv_h[256];	// @ 0x1100
		uint8_t ydepth_h[256];	// @ 0x1200
		uint8_t x2a_l[256];	// @ 0x1300
		uint8_t x2a_h[256];	// @ 0x1400
		uint8_t swap[256];	// @ 0x1500
		uint8_t bank[256];	// @ 0x1600
		uint8_t pvxjmp_l[128];	// @ 0x1700
		uint8_t pvxjmp_h[128];	// @ 0x1780
		uint8_t phxjmp_l[84];	// @ 0x1800
		uint8_t plxjmp_l[88];	// @ 0x1854
		uint8_t phxjmp_h[84];	// @ 0x18AC
		uint8_t plxjmp_h[88];	// @ 0x1900
		uint8_t xoffs_h[168];	// @ 0x1958
		uint8_t psxjmp_l[256];	// @ 0x1A00
		uint8_t psxjmp_h[256];	// @ 0x1B00
		uint8_t ptxjmp_l[128];	// @ 0x1C00
		uint8_t ptxjmp_h[128];	// @ 0x1C80
		uint8_t yoffs_l[128];	// @ 0x1D00
		uint8_t yoffs_h[128];	// @ 0x1D80
		uint8_t htan_l[128];	// @ 0x1E00
		uint8_t htan_h[128];	// @ 0x1E80
		uint8_t sin_l[320];	// @ 0x1F00
		uint8_t sin_h[320];	// @ 0x2040
		uint8_t pxloop[0x1553];	// @ 0x2180
		// 0x36D3
	};
} tables_1100_t;

typedef union
{
	uint8_t raw[256];
	struct
	{
		uint8_t idiv_l[8192];	// @ 0xA000 (bank 59)
		uint8_t tscale_l[4096];	// @ 0xA000 (bank 60) [texture scale]
		uint8_t tscale_h[4096];	// @ 0xB000 (bank 60) [texture scale]
		uint8_t tan_l[2048];	// @ 0xA000 (bank 61)
		uint8_t tan_h[2048];	// @ 0xA800 (bank 61)
		uint8_t ydepth_l[4096];	// @ 0xB000 (bank 61)
		uint8_t atan_l[4096];	// @ 0xA000 (bank 62)
		uint8_t atan_h[4096];	// @ 0xB000 (bank 62)
		uint8_t a2x_l[2048];	// @ 0xA000 (bank 63)
		uint8_t a2x_h[2048];	// @ 0xA800 (bank 63)
		uint8_t random[2048];	// @ 0xB000 (bank 63)
		uint8_t planex_l[256];	// @ 0xB800 (bank 63) [plane texture stuff]
		uint8_t planex_h[256];	// @ 0xB900 (bank 63) [plane texture stuff]
		uint8_t pitch2yc[256];	// @ 0xBA00 (bank 63)
		// 0xBD00 contains portals (512 bytes)
		// 0xBF00 contains keyboard input table (256 bytes)
	};
} tables_A000_t;

typedef struct
{
	int16_t x, y;
} vertex_t;

typedef struct
{
	int32_t x, y, z;
	uint8_t viewheight;
	int16_t sin, cos;
	int32_t pl_x, pl_y;
	int16_t pl_sin, pl_cos;
	uint16_t a;
	uint16_t lca;
	uint8_t a8;
	uint8_t ycw, ycp;
	uint8_t x0, x1;
	uint8_t x0d, x1d;
	uint8_t ox, oy;
	uint8_t ta, tx;
} projection_t;

typedef struct
{
	kge_sector_t *sector;
	uint8_t x0, x1;
	uint8_t first_sprite;
	uint8_t masked;
} portal_t;

typedef struct
{
	uint8_t clip_top[80];
	uint8_t clip_bot[80];
	uint16_t *data;
	uint32_t *offs;
	uint8_t x0, x1;
	uint8_t next;
	int16_t bot;
	int16_t depth, tex_scale;
	int16_t tex_now, tex_step;
	int16_t dist, scale;
	uint8_t light;
} proj_spr_t;

typedef struct
{
	editor_texture_t *texture;
	int16_t tmap_scale[80];
	uint8_t clip_top[80];
	uint8_t tmap_coord[160];
	uint8_t clip_bot[80];
